/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: swaragay <swaragay@student.42.jp>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/05/09 15:16:34 by swaragay          #+#    #+#             */
/*   Updated: 2026/05/09 17:24:35 by swaragay         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_lstadd_front(t_list **lst, t_list *new)
{
	if (!lst || !new)
		return ;
	new->next = *lst;
	*lst = new;
}

//一番先頭にあった構造体の場所の前に構造体を作成する。

//二番目になったlstのアドレスをnewの構造体に入れる
//現在一番目のアドレスをnewに置き換える
//構造体のメンバではなく全体もあつかうから二重ポインタなのか？？
