/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: swaragay <swaragay@student.42.jp>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/04/30 12:04:50 by swaragay          #+#    #+#             */
/*   Updated: 2026/05/18 14:08:21 by swaragay         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_tolower(int c)
{
	if (!(c >= 65 && c <= 90))
		return (c);
	return (c + 32);
}

// int	main(void)
// {
// 	int	c[6] = {'A', 'a', '2', 1, ' ', ','};
// 	int	i;

// 	i = 0;
// 	while (i < 5)
// 	{
// 		printf("関数再現: %d 関数: %d\n", ft_tolower(c[i]), tolower(c[i]));
// 		i++;
// 	}
// }
