/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isdigit.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: swaragay <swaragay@student.42.jp>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/04/25 17:22:36 by swaragay          #+#    #+#             */
/*   Updated: 2026/04/30 21:30:03 by swaragay         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isdigit(int c)
{
	if (c >= 48 && c <= 57)
		return (1);
	return (0);
}

// int	main(void)
// {
// 	int	c[5] = {'A', '2', 1, ' ', ','};
// 	int	i;

// 	i = 0;
// 	while (i < 5)
// 	{
// 		printf("関数: %d 関数再現: %d\n", ft_isdigit(c[i]), isdigit(c[i]));
// 		i++;
// 	}
// }
